Tekla.Structures.Model.EdgeChamfer
The EdgeChamfer class defines how the part edge is chamfered.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Point Point = new Point(0, 0, 0);
Point Point2 = new Point(1000, 0, 0);
Beam Beam = new Beam();
Beam.StartPoint = Point;
Beam.EndPoint = Point2;
Beam.Profile.ProfileString = "400*400";
Beam.Finish = "PAINT";
Beam.Insert();
EdgeChamfer EdgeChamfer = new EdgeChamfer(new Point(0, -100, 0), new Point(0, 200, 0));
EdgeChamfer.FirstChamferEndType = EdgeChamfer.ChamferEndTypeEnum.BEVELLED;
EdgeChamfer.FirstBevelDimension = 50;
EdgeChamfer.Chamfer.X = 20;
EdgeChamfer.Chamfer.Y = 20;
EdgeChamfer.Father = Beam;
EdgeChamfer.Insert();
}
}

Tekla.Structures.Model.EdgeChamfer.Chamfer
The chamfer values for the EdgeChamfer.

Tekla.Structures.Model.EdgeChamfer.FirstEnd
The start point of the EdgeChamfer.

Tekla.Structures.Model.EdgeChamfer.SecondEnd
The end point of the EdgeChamfer.

Tekla.Structures.Model.EdgeChamfer.FirstChamferEndType
The ChamferEndTypeEnum of the first end.

Tekla.Structures.Model.EdgeChamfer.SecondChamferEndType
The ChamferEndTypeEnum of the second end.

Tekla.Structures.Model.EdgeChamfer.SecondBevelDimension
The bevel dimension if the second end is bevelled.

Tekla.Structures.Model.EdgeChamfer.FirstBevelDimension
The bevel dimension if the first end is bevelled.

Tekla.Structures.Model.EdgeChamfer.Name
The name of the EdgeChamfer instance.

Tekla.Structures.Model.EdgeChamfer.#ctor
Initializes a new instance of the EdgeChamfer class with empty attributes.

Tekla.Structures.Model.EdgeChamfer.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Initializes a new instance of the EdgeChamfer class.
FirstEnd: The first end point of the edge chamfer.
SecondEnd: The second end point of the edge chamfer.

Tekla.Structures.Model.EdgeChamfer.Insert
Inserts the edge chamfer into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.EdgeChamfer.Select
Selects an edge chamfer from the model database. The edge chamfer ID must be set.
Returns: True on success.

Tekla.Structures.Model.EdgeChamfer.Modify
Modifies the existing edge chamfer in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.EdgeChamfer.Delete
Deletes the edge chamfer instance with the given ID from the model database.
Returns: True on success.